driver-tests/bpelse/assign/AssignJbi/test/results/echoNameDataType_Invoke/Actual_20130314144927_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <item xmlns="http://stc.com/echoNameDataType" xmlns:msgns="http://stc.com/echoNameDataType">
      <string>Name</string>
      <normalizedString>Name</normalizedString>
      <token>Name</token>
      <base64Binary>Name</base64Binary>
      <hexBinary>Name</hexBinary>
      <integer>Name</integer>
      <positiveInteger>Name</positiveInteger>
      <negativeInteger>Name</negativeInteger>
      <nonNegativeInteger>Name</nonNegativeInteger>
      <nonPositiveInteger>Name</nonPositiveInteger>
      <long>Name</long>
      <unsignedLong>Name</unsignedLong>
      <int>Name</int>
      <unsignedInt>Name</unsignedInt>
      <short>Name</short>
      <unsignedShort>Name</unsignedShort>
      <byte>Name</byte>
      <unsignedByte>Name</unsignedByte>
      <decimal>Name</decimal>
      <float>Name</float>
      <double>Name</double>
      <boolean>Name</boolean>
      <duration>Name</duration>
      <dateTime>Name</dateTime>
      <date>Name</date>
      <time>Name</time>
      <gYear>Name</gYear>
      <gYearMonth>Name</gYearMonth>
      <gMonth>Name</gMonth>
      <gMonthDay>Name</gMonthDay>
      <gDay>Name</gDay>
      <Name>Name</Name>
      <QName>Name</QName>
      <NCName>Name</NCName>
      <anyURI>Name</anyURI>
      <language>Name</language>
      <ID>Name</ID>
      <IDREF>Name</IDREF>
      <IDREFS>Name</IDREFS>
      <ENTITY>Name</ENTITY>
      <ENTITIES>Name</ENTITIES>
      <NMTOKEN>Name</NMTOKEN>
      <NMTOKENS>Name</NMTOKENS>
    </item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>